       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGCOB01.
      ************************************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = WALLACE
      *OBJETIVO: MOSTRAR A STRING HELLO ALURA
      *DATA = 10/04/2021
      ***********************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO ALURA'.
           STOP RUN.
